export interface Pizza {
    id: number
    name: string
    ingridients: string[]
    dough: string[]
    sizes: string[]
    imageUrl: string
    price: number
}

export const PizzaCatalog: Pizza[] = [
    {
        id: 1,
        name: "Чоризо фреш",
        ingridients: ["Маринованные огурчики", "Свежие томаты", "Красный лук", "Сочные ананасы", "Итальянские травы", "Сладкий перец", "Кубики брынзы", "Митболы"],
        imageUrl: "/assets/pizza1.webp",
        price: 453,
        sizes: ["20 см", "30 см", "40 см"],
        dough: ["Тонкое", "Традиционное"]
    },
    {
        id: 2,
        name: "Пепперони фреш",
        ingridients: ["Сырный бортик", "Сливочная моцарелла", "Сыры чеддер и пармезан", "Нежный цыпленок"],
        imageUrl: "/assets/pizza2.webp",
        price: 205,
        sizes: ["20 см", "30 см", "40 см"],
        dough: ["Тонкое", "Традиционное"]
    },
    {
        id: 3,
        name: "Креветки со сладким чили",
        ingridients: ["Креветки", "Соус сладкий чили", "Сладкий перец", "Сочные ананасы", "Сливочная моцарелла", "Фирменный соус альфредо"],
        imageUrl: "/assets/pizza3.webp",
        price: 469,
        sizes: ["20 см", "30 см", "40 см"],
        dough: ["Тонкое", "Традиционное"]
    },
    {
        id: 4,
        name: "Креветка и песто",
        ingridients: ["Креветки", "Свежие томаты", "Шампиньоны", "Соус песто", "Сливочная моцарелла", "Итальянские травы", "Фирменный томатный соус"],
        imageUrl: "/assets/pizza4.webp",
        price: 479,
        sizes: ["20 см", "30 см", "40 см"],
        dough: ["Тонкое", "Традиционное"]
    },
    {
        id: 5,
        name: "Ветчина и грибы",
        ingridients: ["Ветчина", "Шампиньоны", "Сливочная моцарелла", "Фирменный томатный соус"],
        imageUrl: "/assets/pizza5.webp",
        price: 379,
        sizes: ["20 см", "30 см", "40 см"],
        dough: ["Тонкое", "Традиционное"]
    }
]